# Aufgabe 6

Alle Aufgaben

In [212]:
import pandas as pd
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

In [213]:
t = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')

In [242]:
t.shape

(891, 13)

In [214]:
t.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## 6.1 Einfache Gruppierung

a)Wie viele Passagiere haben keine Information zu ihrer Kabine?

In [215]:
missing_cabine_count = t["Cabin"].isna().sum()
missing_cabine_count

687

b) Haben nur Passagiere der dritten Klasse keine Kabine oder haben wir eher ein
Datenqualit√§tsproblem?

In [216]:
class_3 = t.loc[t["Pclass"]==3, "Cabin"]
class_3.shape

(491,)

In [217]:
clas_3_nan = t.loc[t["Pclass"]==3, "Cabin"].isna()
clas_3_nan.sum()

479

c) Welche unterschiedlichen Kabinen gab es? Erstellen Sie eine sortierte Liste.

In [218]:
sorted_unique_cabins = t.groupby("Cabin").first().index.sort_values().tolist()
sorted_unique_cabins

['A10',
 'A14',
 'A16',
 'A19',
 'A20',
 'A23',
 'A24',
 'A26',
 'A31',
 'A32',
 'A34',
 'A36',
 'A5',
 'A6',
 'A7',
 'B101',
 'B102',
 'B18',
 'B19',
 'B20',
 'B22',
 'B28',
 'B3',
 'B30',
 'B35',
 'B37',
 'B38',
 'B39',
 'B4',
 'B41',
 'B42',
 'B49',
 'B5',
 'B50',
 'B51 B53 B55',
 'B57 B59 B63 B66',
 'B58 B60',
 'B69',
 'B71',
 'B73',
 'B77',
 'B78',
 'B79',
 'B80',
 'B82 B84',
 'B86',
 'B94',
 'B96 B98',
 'C101',
 'C103',
 'C104',
 'C106',
 'C110',
 'C111',
 'C118',
 'C123',
 'C124',
 'C125',
 'C126',
 'C128',
 'C148',
 'C2',
 'C22 C26',
 'C23 C25 C27',
 'C30',
 'C32',
 'C45',
 'C46',
 'C47',
 'C49',
 'C50',
 'C52',
 'C54',
 'C62 C64',
 'C65',
 'C68',
 'C7',
 'C70',
 'C78',
 'C82',
 'C83',
 'C85',
 'C86',
 'C87',
 'C90',
 'C91',
 'C92',
 'C93',
 'C95',
 'C99',
 'D',
 'D10 D12',
 'D11',
 'D15',
 'D17',
 'D19',
 'D20',
 'D21',
 'D26',
 'D28',
 'D30',
 'D33',
 'D35',
 'D36',
 'D37',
 'D45',
 'D46',
 'D47',
 'D48',
 'D49',
 'D50',
 'D56',
 'D6',
 'D7',
 'D9',
 'E10',
 'E101',
 'E12',
 'E121',
 'E17',
 'E24',
 'E25',
 'E31',
 'E33',
 'E34',
 'E36',
 'E38',
 'E40',
 'E44',
 'E46',
 'E49',
 'E50',
 'E58',
 'E63',
 'E67',
 'E68',
 'E77',
 'E8',
 'F E69',
 'F G63',
 'F G73',
 'F2',
 'F33',
 'F38',
 'F4',
 'G6',
 'T']

d) Wie viele unterschiedliche Kabinen gab es?

In [219]:
len(sorted_unique_cabins)

147

e) Gibt es einen Zusammenhang zwischen der Klasse und der Kabinennummer?
<br> <br>
Keinen erkenntlichen Zusammenhang

In [220]:
class1_unique_cabins = t.loc[t["Pclass"]==1, "Cabin"].unique
print(class1_unique_cabins)

<bound method Series.unique of 1              C85
3             C123
6              E46
11            C103
23              A6
          ...
871            D35
872    B51 B53 B55
879            C50
887            B42
889           C148
Name: Cabin, Length: 216, dtype: object>

In [221]:
class2_unique_cabins = t.loc[(t["Pclass"]==2)&(t["Cabin"].notna()), "Cabin"].unique
print(class2_unique_cabins)

<bound method Series.unique of 21      D56
66      F33
123    E101
148      F2
183      F4
193      F2
292       D
303    E101
327       D
340      F2
345     F33
473       D
516     F33
618      F4
717    E101
772     E77
Name: Cabin, dtype: object>

In [222]:
class3_unique_cabins = t.loc[(t["Pclass"]==3)&(t["Cabin"].notna()), "Cabin"].unique
print(class3_unique_cabins)

<bound method Series.unique of 10        G6
75     F G73
128    F E69
205       G6
251       G6
394       G6
429      E10
699    F G63
715    F G73
751     E121
776      F38
823     E121
Name: Cabin, dtype: object>

f) Wie viele Passagiere waren im Schnitt und wie viele maximal in einer Kabine?

Gruppieren nach Klasse und Kabine

In [223]:
grouped_cabine_class = t.groupby(["Pclass","Cabin"])

Durchschnitt von ANzahl passagiere in Kabine

In [224]:
grouped_cabine_passenger = grouped_cabine_class["PassengerId"].count()
grouped_cabine_passenger.mean()

1.3877551020408163

Max Anzahl Passagiere in Kabine

In [225]:
grouped_cabine_passenger.max()

4

g) In wie viele Kabinen waren Minderj√§hrige gebucht?

In [226]:
# Filtern des DataFrames, um nur Minderj√§hrige zu erhalten
minors_df = t[t['Age'] < 18]

# Z√§hlen der einzigartigen Kabinen, in denen Minderj√§hrige gebucht waren
unique_cabins_with_minors = minors_df['Cabin'].nunique()
unique_cabins_with_minors

14

Mit lambda

In [227]:
grouped_cabin = t.groupby("Cabin")

In [228]:
minderj√§hrige_in_kabine = grouped_cabin["Age"].apply(lambda x: (x < 18).any())
minderj√§hrige_in_kabine.sum()

14

## 6.2. Minimum

a) Finden Sie den kleinsten und gr√∂√üten Fahrpreis je Klasse.

In [229]:
grouped_classes = t.groupby("Pclass")

In [230]:
grouped_classes["Fare"].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

In [231]:
grouped_classes["Fare"].min()

Pclass
1    0.0
2    0.0
3    0.0
Name: Fare, dtype: float64

In [232]:
grouped_classes.agg({"Fare":("min","max")})

       Fare
        min       max
Pclass
1       0.0  512.3292
2       0.0   73.5000
3       0.0   69.5500

b) Oft ist man nicht nur am Wert, sondern auch an den zugeh√∂rigen Daten interessiert, die
zu diesem Wert geh√∂ren. Finden Sie mit idxmin() die Namen der Passagiere mit den
extremen Fahrpreisen aus a) heraus.

In [233]:
grouped_classes = t.groupby('Pclass')

min_names = []
max_names = []

for group, group_df in grouped_classes:
    min_idx = group_df['Fare'].idxmin()
    max_idx = group_df['Fare'].idxmax()
    
    min_names.append(t.loc[min_idx, 'Name'])
    max_names.append(t.loc[max_idx, 'Name'])

result = grouped_classes['Fare'].agg(['min', 'max'])
result['min_name'] = min_names
result['max_name'] = max_names

print(result)

        min       max                     min_name                    max_name
Pclass
1       0.0  512.3292        Harrison, Mr. William            Ward, Miss. Anna
2       0.0   73.5000  Parkes, Mr. Francis "Frank"        Hood, Mr. Ambrose Jr
3       0.0   69.5500          Leonard, Mr. Lionel  Sage, Master. Thomas Henry

c) Falls das Minimum / Maximum nicht eindeutig ist, welchen Wert liefert dann
idxmin()?

Die Methoden idxmin() und idxmax() in Pandas geben den Index des ersten Minimums bzw. Maximums zur√ºck, wenn es mehrere Eintr√§ge mit dem gleichen minimalen oder maximalen Wert gibt.

Wenn es also in einer Serie oder einem DataFrame mehrere Zeilen mit dem gleichen minimalen (oder maximalen) Wert gibt, wird idxmin() (oder idxmax()) den Index der ersten dieser Zeilen zur√ºckgeben.

d) Wir w√ºrden gerne alle Passagiere mit extremen Fahrpreisen gem√§√ü a) kennen.

In [234]:
# Rangieren der Fahrpreise in aufsteigender und absteigender Reihenfolge innerhalb jeder Klasse
t['min_rank'] = t.groupby('Pclass')['Fare'].rank(method='min')
t['max_rank'] = t.groupby('Pclass')['Fare'].rank(method='min', ascending=False)

# Filtern des DataFrames, um den ersten Eintrag f√ºr das Minimum und Maximum jeder Klasse zu behalten
min_fares = t[t['min_rank'] == 1].groupby('Pclass').first().reset_index()[['Pclass', 'Name', 'Fare']]
max_fares = t[t['max_rank'] == 1].groupby('Pclass').first().reset_index()[['Pclass', 'Name', 'Fare']]

# Kombinieren der beiden DataFrames
extreme_fares = pd.concat([min_fares, max_fares], axis=0).sort_values(by='Pclass').reset_index(drop=True)

print(extreme_fares)

   Pclass                         Name      Fare
0       1        Harrison, Mr. William    0.0000
1       1             Ward, Miss. Anna  512.3292
2       2  Parkes, Mr. Francis "Frank"    0.0000
3       2         Hood, Mr. Ambrose Jr   73.5000
4       3          Leonard, Mr. Lionel    0.0000
5       3   Sage, Master. Thomas Henry   69.5500

## 6.3. Quantile

Ber√ºcksichtigt quantile() Null-Werte? Testen Sie.

Die quantile() Methode gibt den Wert des angegebenen Quantils f√ºr eine gegebene Datenmenge zur√ºck.

Die Methode quantile() in Pandas ber√ºcksichtigt keine NaN (Null)-Werte bei der Berechnung. Das bedeutet, dass NaN-Werte standardm√§√üig ausgeschlossen werden.

In [235]:
import pandas as pd

# Erstellen eines Beispieldatenframes mit einigen Null-Werten
data = {'values': [10, 20, 30, 40, 50, None, None]}
df = pd.DataFrame(data)

# Berechnen des Quantils ohne die Behandlung von Null-Werten
quantile_without_handling_na = df['values'].quantile(0.5)

# Berechnen des Quantils mit explizitem Ausschluxss von Null-Werten
quantile_with_dropna = df['values'].dropna().quantile(0.5)

quantile_without_handling_na, quantile_with_dropna

(30.0, 30.0)

Test: <br>
- Das Medianquantil (0,5) des Beispieldatenframes ohne explizites Handling von Null-Werten ergab 30.0.
- Das Medianquantil (0,5) des Beispieldatenframes, bei dem NaN-Werte explizit mit dropna() ausgeschlossen wurden, ergab ebenfalls 30.0.

Aggregation und Sortierung
F√ºr welche der vorgestellten Aggregations-Funktionen beeinflusst die Sortierung der
Daten im DataFrame das Ergebnis?

Soweit ich wei√ü keine von
- sum(): Summe der Werte
- mean(): Mittelwert der Werte
- median(): Median der Werte
- min(): Minimum der Werte
- max(): Maximum der Werte
- std(): Standardabweichung
- var(): Varianz
- count(): Anzahl der nicht-NA-Zellen
- nunique(): Anzahl der einzigartigen Werte
- quantile(): Wert am gegebenen Quantil

## 6.5. Duplikate

a) Mit dem Attribut .is_unique kann man herausfinden, ob eine Series nur eindeutige
Werte enth√§lt.
√úberpr√ºfen Sie, ob (‚ÄûName‚Äú) ein Schl√ºssel ist.

In [236]:
t_names = t["Name"]
t_names.is_unique

True

b) Definieren Sie ‚ÄûName‚Äú als Index und stellen Sie per assert sicher, dass er eindeutig ist.

In [237]:
# Setzen des Index
t_index_name = t.set_index('Name', inplace=True)

# Hinweis wenn der Index nicht einzigartig ist 
assert t.index.is_unique, "Der Index 'Name' ist nicht eindeutig!"

c) √úberpr√ºfen Sie, ob (‚ÄûTicket‚Äú, ‚ÄûCabin‚Äú) ein Schl√ºssel ist.

In [238]:
# √úberpr√ºfen, ob "Ticket" eindeutig ist
is_ticket_unique = t['Ticket'].is_unique

# √úberpr√ºfen, ob "Cabin" eindeutig ist
is_cabin_unique = t['Cabin'].is_unique

# √úberpr√ºfen, ob die Kombination aus "Ticket" und "Cabin" eindeutig ist
t['Ticket_Cabin'] = t['Ticket'].astype(str) + '_' + t['Cabin'].astype(str)
is_ticket_cabin_unique = t['Ticket_Cabin'].is_unique

# L√∂schen der zusammengesetzten Spalte
del t['Ticket_Cabin']

is_ticket_unique, is_cabin_unique, is_ticket_cabin_unique
# True, wenn "Ticket" eindeutig ist, sonst False.
# True, wenn "Cabin" eindeutig ist, sonst False.
# True, wenn die Kombination aus "Ticket" und "Cabin" eindeutig ist, sonst False.

(False, False, False)

d) Ermitteln Sie die Passagiere, f√ºr die es mindestens 4 (damit das Ergebnis kleiner wird)
Duplikate f√ºr (‚ÄûTicket‚Äú, ‚ÄûCabin‚Äú) erzeugen.

In [240]:

# Gruppieren nach "Ticket" und "Cabin" und z√§hlen der Passagiere in jeder Gruppe
grouped_counts = t.groupby(['Ticket', 'Cabin']).size()

# Filtern der Gruppen, die mindestens 4 Duplikate haben
tickets_cabins_with_duplicates = grouped_counts[grouped_counts >= 4].index.tolist()

# Filtern des DataFrames, um Passagiere mit den identifizierten "Ticket" und "Cabin"-Kombinationen zu erhalten
passengers_with_duplicates = t[t.set_index(['Ticket', 'Cabin']).index.isin(tickets_cabins_with_duplicates)]

passengers_with_duplicates[['Ticket', 'Cabin']]

                                           Ticket        Cabin
Name
Fortune, Mr. Charles Alexander              19950  C23 C25 C27
Fortune, Miss. Mabel Helen                  19950  C23 C25 C27
Fortune, Miss. Alice Elizabeth              19950  C23 C25 C27
Carter, Mr. William Ernest                 113760      B96 B98
Carter, Miss. Lucile Polk                  113760      B96 B98
Fortune, Mr. Mark                           19950  C23 C25 C27
Carter, Mrs. William Ernest (Lucile Polk)  113760      B96 B98
Carter, Master. William Thornton II        113760      B96 B98

e) Ermitteln Sie die Duplikate von d) √ºber value_counts().

In [241]:
# Kombinieren von "Ticket" und "Cabin" in einer Spalte und Verwenden von value_counts() 
ticket_cabin_counts = t[['Ticket', 'Cabin']].astype(str).agg('_'.join, axis=1).value_counts()

# Filtern der Kombinationen, die mindestens 4 Duplikate haben
duplicates = ticket_cabin_counts[ticket_cabin_counts >= 4].index.tolist()

# Filtern des DataFrames, um Passagiere mit den identifizierten "Ticket" und "Cabin"-Kombinationen zu erhalten
passengers_with_duplicates_value_counts = t[t[['Ticket', 'Cabin']].astype(str).agg('_'.join, axis=1).isin(duplicates)]

passengers_with_duplicates_value_counts[['Ticket', 'Cabin']]

                                                      Ticket Cabin
Name
Palsson, Master. Gosta Leonard                        349909   NaN
Andersson, Mr. Anders Johan                           347082   NaN
Rice, Master. Eugene                                  382652   NaN
Palsson, Miss. Torborg Danira                         349909   NaN
Asplund, Mrs. Carl Oscar (Selma Augusta Emilia ...    347077   NaN
...                                                      ...   ...
Sage, Mr. Douglas Bullen                            CA. 2343   NaN
Andersson, Master. Sigvard Harald Elias               347082   NaN
Baclini, Mrs. Solomon (Latifa Qurban)                   2666   NaN
Sage, Miss. Dorothy Edith "Dolly"                   CA. 2343   NaN
Rice, Mrs. William (Margaret Norton)                  382652   NaN

[81 rows x 2 columns]

## 6.6 Wie wird man ein SQL-HAVING in pandas abbilden?

In SQL wird das HAVING-Schl√ºsselwort verwendet, um Bedingungen nach einer Aggregation anzuwenden. In Pandas k√∂nnen Sie eine √§hnliche Funktionalit√§t erreichen, indem Sie die Methode groupby() verwenden, gefolgt von einer Aggregationsfunktion und dann die resultierenden Gruppen mit einer Bedingung filtern.

Zusammenfassend l√§sst sich sagen, dass Sie in Pandas das HAVING-Schl√ºsselwort aus SQL durch die Kombination von groupby(), agg() und Bedingungen mit loc[] abbilden k√∂nnen.